# Красивое лучше, чем уродливое
# Явное лучше, чем неявное
# Простое лучше, чем сложное
# Сложное лучше, чем запутанное
# Одноуровневое лучше, чем вложенное
# Разреженное лучше, чем плотное
# Читаемость имеет значение
# Особые случаи не настолько особые, чтобы нарушать правила
# При этом практичность важнее безупречности
# Ошибки не должны проходить незамеченными
# Если они не были явно подавленными
# Встретив двусмысленность, отбрось искушение угадать.
# Должен существовать один и, желательно, только один очевидный способ сделать это.
# Хотя он поначалу может быть и не очевиден, если вы не голландец.
# Сейчас лучше, чем никогда.
# Хотя никогда зачастую лучше, чем прямо сейчас.
# Если реализацию сложно объяснить — идея плоха.
# Если реализацию легко объяснить — идея, возможно, хороша.
# Пространства имён — отличная штука! Будем делать их больше!

# Great!

a = 1 # Какая операция здесь выполняется?

# Выполняется присвоение значения переменной

# Great!

# Какой тип данных хранится в переменной `a`?

# Тип "int" (целое число)

b = 1.123 # А теперь?

# Тип "float" (Число я плавающей точкой)

# Создай список любимых персонажей (любых)

my_fav_characters = ["Jotaro Kujo", "Joseph Joestar", "Jonathan Joestar", "Noriaki Kakyoin", "Jan Pierre Polnareff"]

# Что не так с именем переменной `awawa`?

# Непонятно что за список?

# Переименуй переменную используя стиль "snake case"

# Great!

# Достаточно на сегодня?

answer = "YES! YES! YES!!"